---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFile.Dispose
source: html/0a848656-aa5e-e17e-5464-044a7d47f061.htm
---
# Autodesk.Revit.DB.IFC.IFCFile.Dispose Method

Releases all resources used by the IFCFile

## Syntax (C#)
```csharp
public void Dispose()
```